particle-iot/device-os/hal/src/nRF52840/ble_hal.cpp
    .onEvtCb = NULL,
    .context = NULL,
};

static uint8_t    s_scanReportBuff[BLE_MAX_SCAN_REPORT_BUF_LEN];
static ble_data_t s_bleScanData = {
    .p_data = s_scanReportBuff,
    .len = BLE_MAX_SCAN_REPORT_BUF_LEN
};


/*
 * Valid TX Power for nRF52840:
 * -40dBm, -20dBm, -16dBm, -12dBm, -8dBm, -4dBm, 0dBm, +2dBm, +3dBm, +4dBm, +5dBm, +6dBm, +7dBm and +8dBm.
 */
static const int8_t s_validTxPower[] = {
    -20, -16, -12, -8, -4, 0, 4, 8
};


static system_error_t sysError(uint32_t error) {
    switch (error) {
        case NRF_SUCCESS:                       return SYSTEM_ERROR_NONE;
        case NRF_ERROR_SVC_HANDLER_MISSING:
        case NRF_ERROR_NOT_SUPPORTED:           return SYSTEM_ERROR_NOT_SUPPORTED;
        case NRF_ERROR_SOFTDEVICE_NOT_ENABLED:
        case NRF_ERROR_INVALID_STATE:           return SYSTEM_ERROR_INVALID_STATE;
        case NRF_ERROR_INTERNAL:                return SYSTEM_ERROR_INTERNAL;
        case NRF_ERROR_NO_MEM:                  return SYSTEM_ERROR_NO_MEMORY;
        case NRF_ERROR_NOT_FOUND:               return SYSTEM_ERROR_NOT_FOUND;
        case NRF_ERROR_INVALID_PARAM:
        case NRF_ERROR_INVALID_LENGTH:
        case NRF_ERROR_INVALID_FLAGS:
        case NRF_ERROR_INVALID_DATA:
        case NRF_ERROR_DATA_SIZE:
        case NRF_ERROR_NULL:                    return SYSTEM_ERROR_INVALID_ARGUMENT;
        case NRF_ERROR_TIMEOUT:                 return SYSTEM_ERROR_TIMEOUT;
        case NRF_ERROR_FORBIDDEN:
        case NRF_ERROR_INVALID_ADDR:            return SYSTEM_ERROR_NOT_ALLOWED;
        case NRF_ERROR_BUSY:                    return SYSTEM_ERROR_BUSY;
        case NRF_ERROR_CONN_COUNT:              return SYSTEM_ERROR_LIMIT_EXCEEDED;
        case NRF_ERROR_RESOURCES:               return SYSTEM_ERROR_ABORTED;
        default:                                return SYSTEM_ERROR_UNKNOWN;
    }
}

static int8_t roundTxPower(int8_t value) {
    uint8_t i = 0;

    for (i = 0; i < sizeof(s_validTxPower); i++) {
        if (value == s_validTxPower[i]) {
            return value;
        }
        else {
            if (value < s_validTxPower[i]) {
                return s_validTxPower[i];
            }
        }
    }

    return s_validTxPower[i - 1];
}

int setAdvData(uint8_t* data, uint16_t len, uint8_t flag) {
    bool advPending = false;

    // It is invalid to provide the same data buffers while advertising.
    if (s_bleInstance.advertising) {
        int err = ble_gap_stop_advertising();
        if (err != SYSTEM_ERROR_NONE) {
            return err;
        }
        advPending = true;
    }

    // Make sure the advertising data or scan response data is consistent.
    ble_gap_adv_data_t bleGapAdvData;
    if (flag == BLE_ADV_DATA_ADVERTISING) {
        bleGapAdvData.adv_data.p_data      = data;
        bleGapAdvData.adv_data.len         = len;
        bleGapAdvData.scan_rsp_data.p_data = s_bleInstance.scanRespData;
        bleGapAdvData.scan_rsp_data.len    = s_bleInstance.scanRespDataLen;
    }
    else {
        bleGapAdvData.adv_data.p_data      = s_bleInstance.advData;
        bleGapAdvData.adv_data.len         = s_bleInstance.advDataLen;
        bleGapAdvData.scan_rsp_data.p_data = data;
        bleGapAdvData.scan_rsp_data.len    = len;
    }

    ret_code_t ret = sd_ble_gap_adv_set_configure(&s_bleInstance.advHandle, &bleGapAdvData, NULL);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gap_adv_set_configure() failed: %u", (unsigned)ret);
        return sysError(ret);
    }

    if (flag == BLE_ADV_DATA_ADVERTISING) {
        memcpy(s_bleInstance.advData, data, len);
        s_bleInstance.advDataLen = len;
    }
    else {
        if (data != NULL) {
            memcpy(s_bleInstance.scanRespData, data, len);
        }
        s_bleInstance.scanRespDataLen = len;
    }

    if (advPending) {
        advPending = false;
        return ble_gap_start_advertising(NULL);
    }

    return SYSTEM_ERROR_NONE;
}

static int fromHalScanParams(const hal_ble_scan_parameters_t* halScanParams, ble_gap_scan_params_t* scanParams) {
    if (halScanParams == NULL || scanParams == NULL) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }

    memset(scanParams, 0x00, sizeof(ble_gap_scan_params_t));

    scanParams->extended      = 0;
    scanParams->active        = halScanParams->active;
    scanParams->interval      = halScanParams->interval;
    scanParams->window        = halScanParams->window;
    scanParams->timeout       = halScanParams->timeout;
    scanParams->scan_phys     = BLE_GAP_PHY_1MBPS;
    scanParams->filter_policy = halScanParams->filter_policy;

    return SYSTEM_ERROR_NONE;
}

static int fromHalConnParams(const hal_ble_connection_parameters_t* halConnParams, ble_gap_conn_params_t* connParams) {
    if (halConnParams == NULL || connParams == NULL) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }

    memset(connParams, 0x00, sizeof(ble_gap_conn_params_t));

    connParams->min_conn_interval = halConnParams->min_conn_interval;
    connParams->max_conn_interval = halConnParams->max_conn_interval;
    connParams->slave_latency     = halConnParams->slave_latency;
    connParams->conn_sup_timeout  = halConnParams->conn_sup_timeout;

    return SYSTEM_ERROR_NONE;
}

static int toHalConnParams(const ble_gap_conn_params_t* connParams, hal_ble_connection_parameters_t* halConnParams) {
    if (halConnParams == NULL || connParams == NULL) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }

    memset(halConnParams, 0x00, sizeof(hal_ble_connection_parameters_t));

    halConnParams->min_conn_interval = connParams->min_conn_interval;
    halConnParams->max_conn_interval = connParams->max_conn_interval;
    halConnParams->slave_latency = connParams->slave_latency;
    halConnParams->conn_sup_timeout = connParams->conn_sup_timeout;

    return SYSTEM_ERROR_NONE;
}

static int fromHalUuid(const hal_ble_uuid_t* halUuid, ble_uuid_t* uuid) {
    if (uuid == NULL || halUuid == NULL) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }

