particle-iot/device-os/hal/src/nRF52840/ble_hal.cpp
    /* Characteristic metadata */
    memset(&charMd, 0, sizeof(charMd));
    fromHalCharacteristicProperties(properties, &charMd.char_props);
    // User Description Descriptor
    if (description != NULL) {
        memset(&userDescAttrMd, 0, sizeof(userDescAttrMd));
        BLE_GAP_CONN_SEC_MODE_SET_OPEN(&userDescAttrMd.read_perm);
        BLE_GAP_CONN_SEC_MODE_SET_NO_ACCESS(&userDescAttrMd.write_perm);
        userDescAttrMd.vloc    = BLE_GATTS_VLOC_STACK;
        userDescAttrMd.rd_auth = 0;
        userDescAttrMd.wr_auth = 0;
        userDescAttrMd.vlen    = 0;

        charMd.p_char_user_desc        = (const uint8_t *)description;
        charMd.char_user_desc_max_size = strlen(description);
        charMd.char_user_desc_size     = strlen(description);
        charMd.p_user_desc_md          = &userDescAttrMd;
    }
    else {
        charMd.p_char_user_desc = NULL;
        charMd.p_user_desc_md   = NULL;
    }
    // Client Characteristic Configuration Descriptor
    if (charMd.char_props.notify || charMd.char_props.indicate) {
        memset(&cccdAttrMd, 0, sizeof(cccdAttrMd));
        BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cccdAttrMd.read_perm);
        BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cccdAttrMd.write_perm);
        cccdAttrMd.vloc = BLE_GATTS_VLOC_STACK;

        charMd.p_cccd_md = &cccdAttrMd;
    }
    // TODO:
    charMd.p_char_pf = NULL;
    charMd.p_sccd_md = NULL;

    /* Characteristic value attribute metadata */
    memset(&valueAttrMd, 0, sizeof(valueAttrMd));
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&valueAttrMd.read_perm);
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&valueAttrMd.write_perm);
    valueAttrMd.vloc    = BLE_GATTS_VLOC_STACK;
    valueAttrMd.rd_auth = 0;
    valueAttrMd.wr_auth = 0;
    valueAttrMd.vlen    = 1;

    /* Characteristic value attribute */
    memset(&charValueAttr, 0, sizeof(charValueAttr));
    charValueAttr.p_uuid    = uuid;
    charValueAttr.p_attr_md = &valueAttrMd;
    charValueAttr.init_len  = 0;
    charValueAttr.init_offs = 0;
    charValueAttr.max_len   = BLE_MAX_CHAR_VALUE_LEN;
    charValueAttr.p_value   = NULL;

    ret = sd_ble_gatts_characteristic_add(svcHandle, &charMd, &charValueAttr, &charHandles);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gatts_characteristic_add() failed: %u", (unsigned)ret);
        return sysError(ret);
    }

    characteristic->properties       = properties;
    characteristic->value_handle     = charHandles.value_handle;
    characteristic->user_desc_handle = charHandles.user_desc_handle;
    characteristic->cccd_handle      = charHandles.cccd_handle;
    characteristic->sccd_handle      = charHandles.sccd_handle;

    LOG_DEBUG(TRACE, "Characteristic value handle: %d.", charHandles.value_handle);
    LOG_DEBUG(TRACE, "Characteristic cccd handle: %d.", charHandles.cccd_handle);

    return SYSTEM_ERROR_NONE;
}

static int writeAttribute(uint16_t connHandle, uint16_t attrHandle, uint8_t* data, uint16_t len, bool response) {
    ble_gattc_write_params_t writeParams;

    if (os_semaphore_create(&s_bleInstance.readWriteSemaphore, 1, 0)) {
        LOG(ERROR, "os_semaphore_create() failed");
        return SYSTEM_ERROR_INTERNAL;
    }

    if (response) {
        writeParams.write_op = BLE_GATT_OP_WRITE_REQ;
    }
    else {
        writeParams.write_op = BLE_GATT_OP_WRITE_CMD;
    }
    writeParams.flags    = BLE_GATT_EXEC_WRITE_FLAG_PREPARED_WRITE;
    writeParams.handle   = attrHandle;
    writeParams.offset   = 0;
    writeParams.len      = len;
    writeParams.p_value  = data;

    ret_code_t ret = sd_ble_gattc_write(connHandle, &writeParams);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gattc_write() failed: %u", (unsigned)ret);
        os_semaphore_destroy(s_bleInstance.readWriteSemaphore);
        return sysError(ret);
    }

    os_semaphore_take(s_bleInstance.readWriteSemaphore, BLE_GENERAL_PROCEDURE_TIMEOUT, false);
    os_semaphore_destroy(s_bleInstance.readWriteSemaphore);

    return SYSTEM_ERROR_NONE;
}

static void isrProcessBleEvent(const ble_evt_t* event, void* context) {
    ret_code_t      ret;
    HalBleEvtMsg_t  msg;
    memset(&msg, 0x00, sizeof(HalBleEvtMsg_t));

    switch (event->header.evt_id) {
        case BLE_GAP_EVT_ADV_SET_TERMINATED: {
            LOG_DEBUG(TRACE, "BLE GAP event: advertising stopped.");
            s_bleInstance.advertising = false;

            if (s_bleInstance.onEvtCb != NULL) {
                msg.handler = (evt_handler_t)s_bleInstance.onEvtCb;
                msg.arg.type = BLE_EVT_ADV_STOPPED;
                msg.arg.params.adv_stopped.version = 0x01;
                msg.arg.params.adv_stopped.reserved = NULL;
                if (os_queue_put(s_bleInstance.evtQueue, &msg, 0, NULL)) {
                    LOG(ERROR, "os_queue_put() failed.");
                }
            }
        } break;

        case BLE_GAP_EVT_ADV_REPORT: {
            LOG_DEBUG(TRACE, "BLE GAP event: advertising report.");

            if (s_bleInstance.onEvtCb != NULL) {
                msg.handler = (evt_handler_t)s_bleInstance.onEvtCb;
                msg.arg.type = BLE_EVT_SCAN_RESULT;
                msg.arg.params.scan_result.version = 0x01;
                msg.arg.params.scan_result.type.connectable = event->evt.gap_evt.params.adv_report.type.connectable;
                msg.arg.params.scan_result.type.scannable = event->evt.gap_evt.params.adv_report.type.scannable;
                msg.arg.params.scan_result.type.directed = event->evt.gap_evt.params.adv_report.type.directed;
                msg.arg.params.scan_result.type.scan_response = event->evt.gap_evt.params.adv_report.type.scan_response;
                msg.arg.params.scan_result.type.extended_pdu = event->evt.gap_evt.params.adv_report.type.extended_pdu;
                msg.arg.params.scan_result.rssi = event->evt.gap_evt.params.adv_report.rssi;
                msg.arg.params.scan_result.data_len = event->evt.gap_evt.params.adv_report.data.len;
                memcpy(msg.arg.params.scan_result.data, event->evt.gap_evt.params.adv_report.data.p_data, msg.arg.params.scan_result.data_len);
                msg.arg.params.scan_result.peer_addr.addr_type = event->evt.gap_evt.params.adv_report.peer_addr.addr_type;
                memcpy(msg.arg.params.scan_result.peer_addr.addr, event->evt.gap_evt.params.adv_report.peer_addr.addr, BLE_SIG_ADDR_LEN);
                if (os_queue_put(s_bleInstance.evtQueue, &msg, 0, NULL)) {
                    LOG(ERROR, "os_queue_put() failed.");
                }
            }

            // Continue scanning, scanning parameters pointer must be set to NULL.
            ret = sd_ble_gap_scan_start(NULL, &s_bleScanData);
            if (ret != NRF_SUCCESS) {
                LOG(ERROR, "sd_ble_gap_scan_start() failed: %u", (unsigned)ret);
            }
        } break;

        case BLE_GAP_EVT_CONNECTED: {
            // FIXME: If multi role is enabled, this flag should not be clear here.
            s_bleInstance.advertising = false;

